espressif/esp-idf/components/soc/esp32s2beta/include/soc/extmem_reg.h
// Copyright 2017-2018 Espressif Systems (Shanghai) PTE LTD
//
// Licensed under the Apache License, Version 2.0 (the "License");
// you may not use this file except in compliance with the License.
// You may obtain a copy of the License at
//
//     http://www.apache.org/licenses/LICENSE-2.0
//
// Unless required by applicable law or agreed to in writing, software
// distributed under the License is distributed on an "AS IS" BASIS,
// WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
// See the License for the specific language governing permissions and
// limitations under the License.
#ifndef _SOC_EXTMEM_REG_H_
#define _SOC_EXTMEM_REG_H_


#ifdef __cplusplus
extern "C" {
#endif
#include "soc.h"
#define DPORT_PRO_DCACHE_CTRL_REG          (DR_REG_EXTMEM_BASE + 0x000)
/* DPORT_PRO_DCACHE_UNLOCK_DONE : RO ;bitpos:[23] ;default: 1'b0 ; */
/*description: */
#define DPORT_PRO_DCACHE_UNLOCK_DONE  (BIT(23))
#define DPORT_PRO_DCACHE_UNLOCK_DONE_M  (BIT(23))
#define DPORT_PRO_DCACHE_UNLOCK_DONE_V  0x1
#define DPORT_PRO_DCACHE_UNLOCK_DONE_S  23
/* DPORT_PRO_DCACHE_UNLOCK_ENA : R/W ;bitpos:[22] ;default: 1'b0 ; */
/*description: */
#define DPORT_PRO_DCACHE_UNLOCK_ENA  (BIT(22))
#define DPORT_PRO_DCACHE_UNLOCK_ENA_M  (BIT(22))
#define DPORT_PRO_DCACHE_UNLOCK_ENA_V  0x1
#define DPORT_PRO_DCACHE_UNLOCK_ENA_S  22
/* DPORT_PRO_DCACHE_PRELOAD_DONE : RO ;bitpos:[21] ;default: 1'b0 ; */
/*description: */
#define DPORT_PRO_DCACHE_PRELOAD_DONE  (BIT(21))
#define DPORT_PRO_DCACHE_PRELOAD_DONE_M  (BIT(21))
#define DPORT_PRO_DCACHE_PRELOAD_DONE_V  0x1
#define DPORT_PRO_DCACHE_PRELOAD_DONE_S  21
/* DPORT_PRO_DCACHE_PRELOAD_ENA : R/W ;bitpos:[20] ;default: 1'b0 ; */
/*description: */
#define DPORT_PRO_DCACHE_PRELOAD_ENA  (BIT(20))
#define DPORT_PRO_DCACHE_PRELOAD_ENA_M  (BIT(20))
#define DPORT_PRO_DCACHE_PRELOAD_ENA_V  0x1
#define DPORT_PRO_DCACHE_PRELOAD_ENA_S  20
/* DPORT_PRO_DCACHE_AUTOLOAD_DONE : RO ;bitpos:[19] ;default: 1'b0 ; */
/*description: */
#define DPORT_PRO_DCACHE_AUTOLOAD_DONE  (BIT(19))
#define DPORT_PRO_DCACHE_AUTOLOAD_DONE_M  (BIT(19))
#define DPORT_PRO_DCACHE_AUTOLOAD_DONE_V  0x1
#define DPORT_PRO_DCACHE_AUTOLOAD_DONE_S  19
/* DPORT_PRO_DCACHE_AUTOLOAD_ENA : R/W ;bitpos:[18] ;default: 1'b0 ; */
/*description: */
#define DPORT_PRO_DCACHE_AUTOLOAD_ENA  (BIT(18))
#define DPORT_PRO_DCACHE_AUTOLOAD_ENA_M  (BIT(18))
#define DPORT_PRO_DCACHE_AUTOLOAD_ENA_V  0x1
#define DPORT_PRO_DCACHE_AUTOLOAD_ENA_S  18
/* DPORT_PRO_DCACHE_LOCK1_EN : R/W ;bitpos:[15] ;default: 1'b0 ; */
/*description: */
#define DPORT_PRO_DCACHE_LOCK1_EN  (BIT(15))
#define DPORT_PRO_DCACHE_LOCK1_EN_M  (BIT(15))
#define DPORT_PRO_DCACHE_LOCK1_EN_V  0x1
#define DPORT_PRO_DCACHE_LOCK1_EN_S  15
/* DPORT_PRO_DCACHE_LOCK0_EN : R/W ;bitpos:[14] ;default: 1'b0 ; */
/*description: */
#define DPORT_PRO_DCACHE_LOCK0_EN  (BIT(14))
#define DPORT_PRO_DCACHE_LOCK0_EN_M  (BIT(14))
#define DPORT_PRO_DCACHE_LOCK0_EN_V  0x1
#define DPORT_PRO_DCACHE_LOCK0_EN_S  14
/* DPORT_PRO_DCACHE_CLEAN_DONE : RO ;bitpos:[13] ;default: 1'b0 ; */
/*description: */
#define DPORT_PRO_DCACHE_CLEAN_DONE  (BIT(13))
#define DPORT_PRO_DCACHE_CLEAN_DONE_M  (BIT(13))
#define DPORT_PRO_DCACHE_CLEAN_DONE_V  0x1
#define DPORT_PRO_DCACHE_CLEAN_DONE_S  13
/* DPORT_PRO_DCACHE_CLEAN_ENA : R/W ;bitpos:[12] ;default: 1'b0 ; */
/*description: */
#define DPORT_PRO_DCACHE_CLEAN_ENA  (BIT(12))
#define DPORT_PRO_DCACHE_CLEAN_ENA_M  (BIT(12))
#define DPORT_PRO_DCACHE_CLEAN_ENA_V  0x1
#define DPORT_PRO_DCACHE_CLEAN_ENA_S  12
/* DPORT_PRO_DCACHE_FLUSH_DONE : RO ;bitpos:[11] ;default: 1'b0 ; */
/*description: */
#define DPORT_PRO_DCACHE_FLUSH_DONE  (BIT(11))
#define DPORT_PRO_DCACHE_FLUSH_DONE_M  (BIT(11))
#define DPORT_PRO_DCACHE_FLUSH_DONE_V  0x1
#define DPORT_PRO_DCACHE_FLUSH_DONE_S  11
/* DPORT_PRO_DCACHE_FLUSH_ENA : R/W ;bitpos:[10] ;default: 1'b0 ; */
/*description: */
#define DPORT_PRO_DCACHE_FLUSH_ENA  (BIT(10))
#define DPORT_PRO_DCACHE_FLUSH_ENA_M  (BIT(10))
#define DPORT_PRO_DCACHE_FLUSH_ENA_V  0x1
#define DPORT_PRO_DCACHE_FLUSH_ENA_S  10
/* DPORT_PRO_DCACHE_INVALIDATE_DONE : RO ;bitpos:[9] ;default: 1'b0 ; */
/*description: */
#define DPORT_PRO_DCACHE_INVALIDATE_DONE  (BIT(9))
#define DPORT_PRO_DCACHE_INVALIDATE_DONE_M  (BIT(9))
#define DPORT_PRO_DCACHE_INVALIDATE_DONE_V  0x1
#define DPORT_PRO_DCACHE_INVALIDATE_DONE_S  9
/* DPORT_PRO_DCACHE_INVALIDATE_ENA : R/W ;bitpos:[8] ;default: 1'b1 ; */
/*description: */
#define DPORT_PRO_DCACHE_INVALIDATE_ENA  (BIT(8))
#define DPORT_PRO_DCACHE_INVALIDATE_ENA_M  (BIT(8))
#define DPORT_PRO_DCACHE_INVALIDATE_ENA_V  0x1
#define DPORT_PRO_DCACHE_INVALIDATE_ENA_S  8
/* DPORT_PRO_DCACHE_BLOCKSIZE_MODE : R/W ;bitpos:[4:3] ;default: 2'b0 ; */
/*description: */
#define DPORT_PRO_DCACHE_BLOCKSIZE_MODE  0x00000003
#define DPORT_PRO_DCACHE_BLOCKSIZE_MODE_M  ((DPORT_PRO_DCACHE_BLOCKSIZE_MODE_V)<<(DPORT_PRO_DCACHE_BLOCKSIZE_MODE_S))
#define DPORT_PRO_DCACHE_BLOCKSIZE_MODE_V  0x3
#define DPORT_PRO_DCACHE_BLOCKSIZE_MODE_S  3
/* DPORT_PRO_DCACHE_SETSIZE_MODE : R/W ;bitpos:[2] ;default: 1'b0 ; */
/*description: */
#define DPORT_PRO_DCACHE_SETSIZE_MODE  (BIT(2))
#define DPORT_PRO_DCACHE_SETSIZE_MODE_M  (BIT(2))
#define DPORT_PRO_DCACHE_SETSIZE_MODE_V  0x1
#define DPORT_PRO_DCACHE_SETSIZE_MODE_S  2
/* DPORT_PRO_DCACHE_MODE : R/W ;bitpos:[1] ;default: 1'b0 ; */
/*description: */
#define DPORT_PRO_DCACHE_MODE  (BIT(1))
#define DPORT_PRO_DCACHE_MODE_M  (BIT(1))
#define DPORT_PRO_DCACHE_MODE_V  0x1
#define DPORT_PRO_DCACHE_MODE_S  1
/* DPORT_PRO_DCACHE_ENABLE : R/W ;bitpos:[0] ;default: 1'b0 ; */
/*description: */
#define DPORT_PRO_DCACHE_ENABLE  (BIT(0))
#define DPORT_PRO_DCACHE_ENABLE_M  (BIT(0))
#define DPORT_PRO_DCACHE_ENABLE_V  0x1
#define DPORT_PRO_DCACHE_ENABLE_S  0

#define DPORT_PRO_DCACHE_CTRL1_REG          (DR_REG_EXTMEM_BASE + 0x004)
/* DPORT_PRO_DCACHE_MASK_BUS3 : R/W ;bitpos:[3] ;default: 1'b1 ; */
/*description: */
#define DPORT_PRO_DCACHE_MASK_BUS3  (BIT(3))
#define DPORT_PRO_DCACHE_MASK_BUS3_M  (BIT(3))
#define DPORT_PRO_DCACHE_MASK_BUS3_V  0x1
#define DPORT_PRO_DCACHE_MASK_BUS3_S  3
/* DPORT_PRO_DCACHE_MASK_BUS2 : R/W ;bitpos:[2] ;default: 1'b1 ; */
/*description: */
#define DPORT_PRO_DCACHE_MASK_BUS2  (BIT(2))
#define DPORT_PRO_DCACHE_MASK_BUS2_M  (BIT(2))
#define DPORT_PRO_DCACHE_MASK_BUS2_V  0x1
#define DPORT_PRO_DCACHE_MASK_BUS2_S  2
/* DPORT_PRO_DCACHE_MASK_BUS1 : R/W ;bitpos:[1] ;default: 1'b1 ; */
/*description: */
#define DPORT_PRO_DCACHE_MASK_BUS1  (BIT(1))
#define DPORT_PRO_DCACHE_MASK_BUS1_M  (BIT(1))
#define DPORT_PRO_DCACHE_MASK_BUS1_V  0x1
#define DPORT_PRO_DCACHE_MASK_BUS1_S  1
/* DPORT_PRO_DCACHE_MASK_BUS0 : R/W ;bitpos:[0] ;default: 1'b1 ; */
/*description: */
#define DPORT_PRO_DCACHE_MASK_BUS0  (BIT(0))
#define DPORT_PRO_DCACHE_MASK_BUS0_M  (BIT(0))
#define DPORT_PRO_DCACHE_MASK_BUS0_V  0x1
#define DPORT_PRO_DCACHE_MASK_BUS0_S  0
#define DPORT_PRO_DCACHE_MASK_DRAM0 DPORT_PRO_DCACHE_MASK_BUS0
#define DPORT_PRO_DCACHE_MASK_DRAM1 DPORT_PRO_DCACHE_MASK_BUS1
#define DPORT_PRO_DCACHE_MASK_DPORT DPORT_PRO_DCACHE_MASK_BUS2
#define DPORT_PRO_DCACHE_MASK_DROM0 DPORT_PRO_DCACHE_MASK_BUS3

#define DPORT_PRO_DCACHE_TAG_POWER_CTRL_REG          (DR_REG_EXTMEM_BASE + 0x008)
/* DPORT_PRO_DCACHE_TAG_MEM_PD : R/W ;bitpos:[1] ;default: 1'b0 ; */
/*description: */
#define DPORT_PRO_DCACHE_TAG_MEM_PD  (BIT(1))
#define DPORT_PRO_DCACHE_TAG_MEM_PD_M  (BIT(1))
#define DPORT_PRO_DCACHE_TAG_MEM_PD_V  0x1
#define DPORT_PRO_DCACHE_TAG_MEM_PD_S  1
/* DPORT_PRO_DCACHE_TAG_MEM_FORCE_ON : R/W ;bitpos:[0] ;default: 1'b1 ; */
/*description: */
#define DPORT_PRO_DCACHE_TAG_MEM_FORCE_ON  (BIT(0))
#define DPORT_PRO_DCACHE_TAG_MEM_FORCE_ON_M  (BIT(0))
#define DPORT_PRO_DCACHE_TAG_MEM_FORCE_ON_V  0x1
#define DPORT_PRO_DCACHE_TAG_MEM_FORCE_ON_S  0

