espressif/esp-idf/components/soc/esp32s2beta/include/soc/extmem_reg.h
#define DPORT_PRO_DCACHE_LOCK0_ADDR_REG          (DR_REG_EXTMEM_BASE + 0x00C)
/* DPORT_PRO_DCACHE_LOCK0_ADDR : R/W ;bitpos:[31:0] ;default: 10'h0 ; */
/*description: */
#define DPORT_PRO_DCACHE_LOCK0_ADDR  0xFFFFFFFF
#define DPORT_PRO_DCACHE_LOCK0_ADDR_M  ((DPORT_PRO_DCACHE_LOCK0_ADDR_V)<<(DPORT_PRO_DCACHE_LOCK0_ADDR_S))
#define DPORT_PRO_DCACHE_LOCK0_ADDR_V  0xFFFFFFFF
#define DPORT_PRO_DCACHE_LOCK0_ADDR_S  0

#define DPORT_PRO_DCACHE_LOCK0_SIZE_REG          (DR_REG_EXTMEM_BASE + 0x010)
/* DPORT_PRO_DCACHE_LOCK0_SIZE : R/W ;bitpos:[15:0] ;default: 16'h0 ; */
/*description: */
#define DPORT_PRO_DCACHE_LOCK0_SIZE  0x0000FFFF
#define DPORT_PRO_DCACHE_LOCK0_SIZE_M  ((DPORT_PRO_DCACHE_LOCK0_SIZE_V)<<(DPORT_PRO_DCACHE_LOCK0_SIZE_S))
#define DPORT_PRO_DCACHE_LOCK0_SIZE_V  0xFFFF
#define DPORT_PRO_DCACHE_LOCK0_SIZE_S  0

#define DPORT_PRO_DCACHE_LOCK1_ADDR_REG          (DR_REG_EXTMEM_BASE + 0x014)
/* DPORT_PRO_DCACHE_LOCK1_ADDR : R/W ;bitpos:[31:0] ;default: 10'h0 ; */
/*description: */
#define DPORT_PRO_DCACHE_LOCK1_ADDR  0xFFFFFFFF
#define DPORT_PRO_DCACHE_LOCK1_ADDR_M  ((DPORT_PRO_DCACHE_LOCK1_ADDR_V)<<(DPORT_PRO_DCACHE_LOCK1_ADDR_S))
#define DPORT_PRO_DCACHE_LOCK1_ADDR_V  0xFFFFFFFF
#define DPORT_PRO_DCACHE_LOCK1_ADDR_S  0

#define DPORT_PRO_DCACHE_LOCK1_SIZE_REG          (DR_REG_EXTMEM_BASE + 0x018)
/* DPORT_PRO_DCACHE_LOCK1_SIZE : R/W ;bitpos:[15:0] ;default: 16'h0 ; */
/*description: */
#define DPORT_PRO_DCACHE_LOCK1_SIZE  0x0000FFFF
#define DPORT_PRO_DCACHE_LOCK1_SIZE_M  ((DPORT_PRO_DCACHE_LOCK1_SIZE_V)<<(DPORT_PRO_DCACHE_LOCK1_SIZE_S))
#define DPORT_PRO_DCACHE_LOCK1_SIZE_V  0xFFFF
#define DPORT_PRO_DCACHE_LOCK1_SIZE_S  0

#define DPORT_PRO_DCACHE_MEM_SYNC0_REG          (DR_REG_EXTMEM_BASE + 0x01C)
/* DPORT_PRO_DCACHE_MEMSYNC_ADDR : R/W ;bitpos:[31:0] ;default: 32'b0 ; */
/*description: */
#define DPORT_PRO_DCACHE_MEMSYNC_ADDR  0xFFFFFFFF
#define DPORT_PRO_DCACHE_MEMSYNC_ADDR_M  ((DPORT_PRO_DCACHE_MEMSYNC_ADDR_V)<<(DPORT_PRO_DCACHE_MEMSYNC_ADDR_S))
#define DPORT_PRO_DCACHE_MEMSYNC_ADDR_V  0xFFFFFFFF
#define DPORT_PRO_DCACHE_MEMSYNC_ADDR_S  0

#define DPORT_PRO_DCACHE_MEM_SYNC1_REG          (DR_REG_EXTMEM_BASE + 0x020)
/* DPORT_PRO_DCACHE_MEMSYNC_SIZE : R/W ;bitpos:[22:0] ;default: 23'h400000 ; */
/*description: */
#define DPORT_PRO_DCACHE_MEMSYNC_SIZE  0x007FFFFF
#define DPORT_PRO_DCACHE_MEMSYNC_SIZE_M  ((DPORT_PRO_DCACHE_MEMSYNC_SIZE_V)<<(DPORT_PRO_DCACHE_MEMSYNC_SIZE_S))
#define DPORT_PRO_DCACHE_MEMSYNC_SIZE_V  0x7FFFFF
#define DPORT_PRO_DCACHE_MEMSYNC_SIZE_S  0

#define DPORT_PRO_DCACHE_PRELOAD_ADDR_REG          (DR_REG_EXTMEM_BASE + 0x024)
/* DPORT_PRO_DCACHE_PRELOAD_ADDR : R/W ;bitpos:[31:0] ;default: 32'b0 ; */
/*description: */
#define DPORT_PRO_DCACHE_PRELOAD_ADDR  0xFFFFFFFF
#define DPORT_PRO_DCACHE_PRELOAD_ADDR_M  ((DPORT_PRO_DCACHE_PRELOAD_ADDR_V)<<(DPORT_PRO_DCACHE_PRELOAD_ADDR_S))
#define DPORT_PRO_DCACHE_PRELOAD_ADDR_V  0xFFFFFFFF
#define DPORT_PRO_DCACHE_PRELOAD_ADDR_S  0

#define DPORT_PRO_DCACHE_PRELOAD_SIZE_REG          (DR_REG_EXTMEM_BASE + 0x028)
/* DPORT_PRO_DCACHE_PRELOAD_ORDER : R/W ;bitpos:[16] ;default: 1'b0 ; */
/*description: */
#define DPORT_PRO_DCACHE_PRELOAD_ORDER  (BIT(16))
#define DPORT_PRO_DCACHE_PRELOAD_ORDER_M  (BIT(16))
#define DPORT_PRO_DCACHE_PRELOAD_ORDER_V  0x1
#define DPORT_PRO_DCACHE_PRELOAD_ORDER_S  16
/* DPORT_PRO_DCACHE_PRELOAD_SIZE : R/W ;bitpos:[15:0] ;default: 16'h8000 ; */
/*description: */
#define DPORT_PRO_DCACHE_PRELOAD_SIZE  0x0000FFFF
#define DPORT_PRO_DCACHE_PRELOAD_SIZE_M  ((DPORT_PRO_DCACHE_PRELOAD_SIZE_V)<<(DPORT_PRO_DCACHE_PRELOAD_SIZE_S))
#define DPORT_PRO_DCACHE_PRELOAD_SIZE_V  0xFFFF
#define DPORT_PRO_DCACHE_PRELOAD_SIZE_S  0

#define DPORT_PRO_DCACHE_AUTOLOAD_CFG_REG          (DR_REG_EXTMEM_BASE + 0x02C)
/* DPORT_PRO_DCACHE_AUTOLOAD_SIZE : R/W ;bitpos:[21:6] ;default: 16'h1 ; */
/*description: */
#define DPORT_PRO_DCACHE_AUTOLOAD_SIZE  0x0000FFFF
#define DPORT_PRO_DCACHE_AUTOLOAD_SIZE_M  ((DPORT_PRO_DCACHE_AUTOLOAD_SIZE_V)<<(DPORT_PRO_DCACHE_AUTOLOAD_SIZE_S))
#define DPORT_PRO_DCACHE_AUTOLOAD_SIZE_V  0xFFFF
#define DPORT_PRO_DCACHE_AUTOLOAD_SIZE_S  6
/* DPORT_PRO_DCACHE_AUTOLOAD_RQST : R/W ;bitpos:[5:4] ;default: 1'b0 ; */
/*description: */
#define DPORT_PRO_DCACHE_AUTOLOAD_RQST  0x00000003
#define DPORT_PRO_DCACHE_AUTOLOAD_RQST_M  ((DPORT_PRO_DCACHE_AUTOLOAD_RQST_V)<<(DPORT_PRO_DCACHE_AUTOLOAD_RQST_S))
#define DPORT_PRO_DCACHE_AUTOLOAD_RQST_V  0x3
#define DPORT_PRO_DCACHE_AUTOLOAD_RQST_S  4
/* DPORT_PRO_DCACHE_AUTOLOAD_ORDER : R/W ;bitpos:[3] ;default: 1'b0 ; */
/*description: */
#define DPORT_PRO_DCACHE_AUTOLOAD_ORDER  (BIT(3))
#define DPORT_PRO_DCACHE_AUTOLOAD_ORDER_M  (BIT(3))
#define DPORT_PRO_DCACHE_AUTOLOAD_ORDER_V  0x1
#define DPORT_PRO_DCACHE_AUTOLOAD_ORDER_S  3
/* DPORT_PRO_DCACHE_AUTOLOAD_STEP : R/W ;bitpos:[2:1] ;default: 2'b0 ; */
/*description: */
#define DPORT_PRO_DCACHE_AUTOLOAD_STEP  0x00000003
#define DPORT_PRO_DCACHE_AUTOLOAD_STEP_M  ((DPORT_PRO_DCACHE_AUTOLOAD_STEP_V)<<(DPORT_PRO_DCACHE_AUTOLOAD_STEP_S))
#define DPORT_PRO_DCACHE_AUTOLOAD_STEP_V  0x3
#define DPORT_PRO_DCACHE_AUTOLOAD_STEP_S  1
/* DPORT_PRO_DCACHE_AUTOLOAD_MODE : R/W ;bitpos:[0] ;default: 1'd0 ; */
/*description: */
#define DPORT_PRO_DCACHE_AUTOLOAD_MODE  (BIT(0))
#define DPORT_PRO_DCACHE_AUTOLOAD_MODE_M  (BIT(0))
#define DPORT_PRO_DCACHE_AUTOLOAD_MODE_V  0x1
#define DPORT_PRO_DCACHE_AUTOLOAD_MODE_S  0

#define DPORT_PRO_DCACHE_AUTOLOAD_SECTION0_ADDR_REG          (DR_REG_EXTMEM_BASE + 0x030)
/* DPORT_PRO_DCACHE_AUTOLOAD_SCT0_ADDR : R/W ;bitpos:[31:0] ;default: 32'b0 ; */
/*description: */
#define DPORT_PRO_DCACHE_AUTOLOAD_SCT0_ADDR  0xFFFFFFFF
#define DPORT_PRO_DCACHE_AUTOLOAD_SCT0_ADDR_M  ((DPORT_PRO_DCACHE_AUTOLOAD_SCT0_ADDR_V)<<(DPORT_PRO_DCACHE_AUTOLOAD_SCT0_ADDR_S))
#define DPORT_PRO_DCACHE_AUTOLOAD_SCT0_ADDR_V  0xFFFFFFFF
#define DPORT_PRO_DCACHE_AUTOLOAD_SCT0_ADDR_S  0

#define DPORT_PRO_DCACHE_AUTOLOAD_SECTION0_SIZE_REG          (DR_REG_EXTMEM_BASE + 0x034)
/* DPORT_PRO_DCACHE_AUTOLOAD_SCT0_SIZE : R/W ;bitpos:[23:0] ;default: 24'h8000 ; */
/*description: */
#define DPORT_PRO_DCACHE_AUTOLOAD_SCT0_SIZE  0x00FFFFFF
#define DPORT_PRO_DCACHE_AUTOLOAD_SCT0_SIZE_M  ((DPORT_PRO_DCACHE_AUTOLOAD_SCT0_SIZE_V)<<(DPORT_PRO_DCACHE_AUTOLOAD_SCT0_SIZE_S))
#define DPORT_PRO_DCACHE_AUTOLOAD_SCT0_SIZE_V  0xFFFFFF
#define DPORT_PRO_DCACHE_AUTOLOAD_SCT0_SIZE_S  0

#define DPORT_PRO_DCACHE_AUTOLOAD_SECTION1_ADDR_REG          (DR_REG_EXTMEM_BASE + 0x038)
/* DPORT_PRO_DCACHE_AUTOLOAD_SCT1_ADDR : R/W ;bitpos:[31:0] ;default: 32'b0 ; */
/*description: */
#define DPORT_PRO_DCACHE_AUTOLOAD_SCT1_ADDR  0xFFFFFFFF
#define DPORT_PRO_DCACHE_AUTOLOAD_SCT1_ADDR_M  ((DPORT_PRO_DCACHE_AUTOLOAD_SCT1_ADDR_V)<<(DPORT_PRO_DCACHE_AUTOLOAD_SCT1_ADDR_S))
#define DPORT_PRO_DCACHE_AUTOLOAD_SCT1_ADDR_V  0xFFFFFFFF
#define DPORT_PRO_DCACHE_AUTOLOAD_SCT1_ADDR_S  0

#define DPORT_PRO_DCACHE_AUTOLOAD_SECTION1_SIZE_REG          (DR_REG_EXTMEM_BASE + 0x03C)
/* DPORT_PRO_DCACHE_AUTOLOAD_SCT1_SIZE : R/W ;bitpos:[23:0] ;default: 24'h8000 ; */
/*description: */
#define DPORT_PRO_DCACHE_AUTOLOAD_SCT1_SIZE  0x00FFFFFF
#define DPORT_PRO_DCACHE_AUTOLOAD_SCT1_SIZE_M  ((DPORT_PRO_DCACHE_AUTOLOAD_SCT1_SIZE_V)<<(DPORT_PRO_DCACHE_AUTOLOAD_SCT1_SIZE_S))
#define DPORT_PRO_DCACHE_AUTOLOAD_SCT1_SIZE_V  0xFFFFFF
#define DPORT_PRO_DCACHE_AUTOLOAD_SCT1_SIZE_S  0

#define DPORT_PRO_ICACHE_CTRL_REG          (DR_REG_EXTMEM_BASE + 0x040)
/* DPORT_PRO_ICACHE_UNLOCK_DONE : RO ;bitpos:[23] ;default: 1'b0 ; */
/*description: */
#define DPORT_PRO_ICACHE_UNLOCK_DONE  (BIT(23))
#define DPORT_PRO_ICACHE_UNLOCK_DONE_M  (BIT(23))
#define DPORT_PRO_ICACHE_UNLOCK_DONE_V  0x1
#define DPORT_PRO_ICACHE_UNLOCK_DONE_S  23
/* DPORT_PRO_ICACHE_UNLOCK_ENA : R/W ;bitpos:[22] ;default: 1'b0 ; */
/*description: */
#define DPORT_PRO_ICACHE_UNLOCK_ENA  (BIT(22))
#define DPORT_PRO_ICACHE_UNLOCK_ENA_M  (BIT(22))
#define DPORT_PRO_ICACHE_UNLOCK_ENA_V  0x1
#define DPORT_PRO_ICACHE_UNLOCK_ENA_S  22
/* DPORT_PRO_ICACHE_PRELOAD_DONE : RO ;bitpos:[21] ;default: 1'b0 ; */
/*description: */
#define DPORT_PRO_ICACHE_PRELOAD_DONE  (BIT(21))
#define DPORT_PRO_ICACHE_PRELOAD_DONE_M  (BIT(21))
#define DPORT_PRO_ICACHE_PRELOAD_DONE_V  0x1
#define DPORT_PRO_ICACHE_PRELOAD_DONE_S  21
/* DPORT_PRO_ICACHE_PRELOAD_ENA : R/W ;bitpos:[20] ;default: 1'b0 ; */
/*description: */
#define DPORT_PRO_ICACHE_PRELOAD_ENA  (BIT(20))
#define DPORT_PRO_ICACHE_PRELOAD_ENA_M  (BIT(20))
#define DPORT_PRO_ICACHE_PRELOAD_ENA_V  0x1
#define DPORT_PRO_ICACHE_PRELOAD_ENA_S  20
/* DPORT_PRO_ICACHE_AUTOLOAD_DONE : RO ;bitpos:[19] ;default: 1'b0 ; */
/*description: */
#define DPORT_PRO_ICACHE_AUTOLOAD_DONE  (BIT(19))
#define DPORT_PRO_ICACHE_AUTOLOAD_DONE_M  (BIT(19))
#define DPORT_PRO_ICACHE_AUTOLOAD_DONE_V  0x1
#define DPORT_PRO_ICACHE_AUTOLOAD_DONE_S  19
/* DPORT_PRO_ICACHE_AUTOLOAD_ENA : R/W ;bitpos:[18] ;default: 1'b0 ; */
/*description: */
#define DPORT_PRO_ICACHE_AUTOLOAD_ENA  (BIT(18))
#define DPORT_PRO_ICACHE_AUTOLOAD_ENA_M  (BIT(18))
#define DPORT_PRO_ICACHE_AUTOLOAD_ENA_V  0x1
#define DPORT_PRO_ICACHE_AUTOLOAD_ENA_S  18
/* DPORT_PRO_ICACHE_LOCK1_EN : R/W ;bitpos:[15] ;default: 1'b0 ; */
/*description: */
#define DPORT_PRO_ICACHE_LOCK1_EN  (BIT(15))
#define DPORT_PRO_ICACHE_LOCK1_EN_M  (BIT(15))
#define DPORT_PRO_ICACHE_LOCK1_EN_V  0x1
#define DPORT_PRO_ICACHE_LOCK1_EN_S  15
/* DPORT_PRO_ICACHE_LOCK0_EN : R/W ;bitpos:[14] ;default: 1'b0 ; */
/*description: */
#define DPORT_PRO_ICACHE_LOCK0_EN  (BIT(14))
#define DPORT_PRO_ICACHE_LOCK0_EN_M  (BIT(14))
#define DPORT_PRO_ICACHE_LOCK0_EN_V  0x1
#define DPORT_PRO_ICACHE_LOCK0_EN_S  14
/* DPORT_PRO_ICACHE_INVALIDATE_DONE : RO ;bitpos:[9] ;default: 1'b0 ; */
/*description: */
#define DPORT_PRO_ICACHE_INVALIDATE_DONE  (BIT(9))
#define DPORT_PRO_ICACHE_INVALIDATE_DONE_M  (BIT(9))
#define DPORT_PRO_ICACHE_INVALIDATE_DONE_V  0x1
#define DPORT_PRO_ICACHE_INVALIDATE_DONE_S  9
/* DPORT_PRO_ICACHE_INVALIDATE_ENA : R/W ;bitpos:[8] ;default: 1'b1 ; */
/*description: */
#define DPORT_PRO_ICACHE_INVALIDATE_ENA  (BIT(8))
#define DPORT_PRO_ICACHE_INVALIDATE_ENA_M  (BIT(8))
#define DPORT_PRO_ICACHE_INVALIDATE_ENA_V  0x1
#define DPORT_PRO_ICACHE_INVALIDATE_ENA_S  8
/* DPORT_PRO_ICACHE_BLOCKSIZE_MODE : R/W ;bitpos:[4:3] ;default: 2'b0 ; */
/*description: */
#define DPORT_PRO_ICACHE_BLOCKSIZE_MODE  0x00000003
#define DPORT_PRO_ICACHE_BLOCKSIZE_MODE_M  ((DPORT_PRO_ICACHE_BLOCKSIZE_MODE_V)<<(DPORT_PRO_ICACHE_BLOCKSIZE_MODE_S))
#define DPORT_PRO_ICACHE_BLOCKSIZE_MODE_V  0x3
#define DPORT_PRO_ICACHE_BLOCKSIZE_MODE_S  3
/* DPORT_PRO_ICACHE_SETSIZE_MODE : R/W ;bitpos:[2] ;default: 1'b0 ; */
/*description: */
#define DPORT_PRO_ICACHE_SETSIZE_MODE  (BIT(2))
#define DPORT_PRO_ICACHE_SETSIZE_MODE_M  (BIT(2))
#define DPORT_PRO_ICACHE_SETSIZE_MODE_V  0x1
#define DPORT_PRO_ICACHE_SETSIZE_MODE_S  2
/* DPORT_PRO_ICACHE_MODE : R/W ;bitpos:[1] ;default: 1'b0 ; */
/*description: */
#define DPORT_PRO_ICACHE_MODE  (BIT(1))
#define DPORT_PRO_ICACHE_MODE_M  (BIT(1))
#define DPORT_PRO_ICACHE_MODE_V  0x1
#define DPORT_PRO_ICACHE_MODE_S  1
/* DPORT_PRO_ICACHE_ENABLE : R/W ;bitpos:[0] ;default: 1'b0 ; */
/*description: */
#define DPORT_PRO_ICACHE_ENABLE  (BIT(0))
#define DPORT_PRO_ICACHE_ENABLE_M  (BIT(0))
#define DPORT_PRO_ICACHE_ENABLE_V  0x1
#define DPORT_PRO_ICACHE_ENABLE_S  0

