espressif/esp-idf/components/soc/esp32s2beta/include/soc/extmem_reg.h
#define DPORT_PRO_ICACHE_CTRL1_REG          (DR_REG_EXTMEM_BASE + 0x044)
/* DPORT_PRO_ICACHE_MASK_BUS3 : R/W ;bitpos:[3] ;default: 1'b1 ; */
/*description: */
#define DPORT_PRO_ICACHE_MASK_BUS3  (BIT(3))
#define DPORT_PRO_ICACHE_MASK_BUS3_M  (BIT(3))
#define DPORT_PRO_ICACHE_MASK_BUS3_V  0x1
#define DPORT_PRO_ICACHE_MASK_BUS3_S  3
/* DPORT_PRO_ICACHE_MASK_BUS2 : R/W ;bitpos:[2] ;default: 1'b1 ; */
/*description: */
#define DPORT_PRO_ICACHE_MASK_BUS2  (BIT(2))
#define DPORT_PRO_ICACHE_MASK_BUS2_M  (BIT(2))
#define DPORT_PRO_ICACHE_MASK_BUS2_V  0x1
#define DPORT_PRO_ICACHE_MASK_BUS2_S  2
/* DPORT_PRO_ICACHE_MASK_BUS1 : R/W ;bitpos:[1] ;default: 1'b1 ; */
/*description: */
#define DPORT_PRO_ICACHE_MASK_BUS1  (BIT(1))
#define DPORT_PRO_ICACHE_MASK_BUS1_M  (BIT(1))
#define DPORT_PRO_ICACHE_MASK_BUS1_V  0x1
#define DPORT_PRO_ICACHE_MASK_BUS1_S  1
/* DPORT_PRO_ICACHE_MASK_BUS0 : R/W ;bitpos:[0] ;default: 1'b1 ; */
/*description: */
#define DPORT_PRO_ICACHE_MASK_BUS0  (BIT(0))
#define DPORT_PRO_ICACHE_MASK_BUS0_M  (BIT(0))
#define DPORT_PRO_ICACHE_MASK_BUS0_V  0x1
#define DPORT_PRO_ICACHE_MASK_BUS0_S  0
#define DPORT_PRO_ICACHE_MASK_IRAM0 DPORT_PRO_ICACHE_MASK_BUS0
#define DPORT_PRO_ICACHE_MASK_IRAM1 DPORT_PRO_ICACHE_MASK_BUS1
#define DPORT_PRO_ICACHE_MASK_IROM0 DPORT_PRO_ICACHE_MASK_BUS2
#define DPORT_PRO_ICACHE_MASK_DROM0 DPORT_PRO_ICACHE_MASK_BUS3

#define DPORT_PRO_ICACHE_TAG_POWER_CTRL_REG          (DR_REG_EXTMEM_BASE + 0x048)
/* DPORT_PRO_ICACHE_TAG_MEM_PD : R/W ;bitpos:[1] ;default: 1'b0 ; */
/*description: */
#define DPORT_PRO_ICACHE_TAG_MEM_PD  (BIT(1))
#define DPORT_PRO_ICACHE_TAG_MEM_PD_M  (BIT(1))
#define DPORT_PRO_ICACHE_TAG_MEM_PD_V  0x1
#define DPORT_PRO_ICACHE_TAG_MEM_PD_S  1
/* DPORT_PRO_ICACHE_TAG_MEM_FORCE_ON : R/W ;bitpos:[0] ;default: 1'b1 ; */
/*description: */
#define DPORT_PRO_ICACHE_TAG_MEM_FORCE_ON  (BIT(0))
#define DPORT_PRO_ICACHE_TAG_MEM_FORCE_ON_M  (BIT(0))
#define DPORT_PRO_ICACHE_TAG_MEM_FORCE_ON_V  0x1
#define DPORT_PRO_ICACHE_TAG_MEM_FORCE_ON_S  0

#define DPORT_PRO_ICACHE_LOCK0_ADDR_REG          (DR_REG_EXTMEM_BASE + 0x04C)
/* DPORT_PRO_ICACHE_LOCK0_ADDR : R/W ;bitpos:[31:0] ;default: 10'h0 ; */
/*description: */
#define DPORT_PRO_ICACHE_LOCK0_ADDR  0xFFFFFFFF
#define DPORT_PRO_ICACHE_LOCK0_ADDR_M  ((DPORT_PRO_ICACHE_LOCK0_ADDR_V)<<(DPORT_PRO_ICACHE_LOCK0_ADDR_S))
#define DPORT_PRO_ICACHE_LOCK0_ADDR_V  0xFFFFFFFF
#define DPORT_PRO_ICACHE_LOCK0_ADDR_S  0

#define DPORT_PRO_ICACHE_LOCK0_SIZE_REG          (DR_REG_EXTMEM_BASE + 0x050)
/* DPORT_PRO_ICACHE_LOCK0_SIZE : R/W ;bitpos:[15:0] ;default: 16'h0 ; */
/*description: */
#define DPORT_PRO_ICACHE_LOCK0_SIZE  0x0000FFFF
#define DPORT_PRO_ICACHE_LOCK0_SIZE_M  ((DPORT_PRO_ICACHE_LOCK0_SIZE_V)<<(DPORT_PRO_ICACHE_LOCK0_SIZE_S))
#define DPORT_PRO_ICACHE_LOCK0_SIZE_V  0xFFFF
#define DPORT_PRO_ICACHE_LOCK0_SIZE_S  0

#define DPORT_PRO_ICACHE_LOCK1_ADDR_REG          (DR_REG_EXTMEM_BASE + 0x054)
/* DPORT_PRO_ICACHE_LOCK1_ADDR : R/W ;bitpos:[31:0] ;default: 10'h0 ; */
/*description: */
#define DPORT_PRO_ICACHE_LOCK1_ADDR  0xFFFFFFFF
#define DPORT_PRO_ICACHE_LOCK1_ADDR_M  ((DPORT_PRO_ICACHE_LOCK1_ADDR_V)<<(DPORT_PRO_ICACHE_LOCK1_ADDR_S))
#define DPORT_PRO_ICACHE_LOCK1_ADDR_V  0xFFFFFFFF
#define DPORT_PRO_ICACHE_LOCK1_ADDR_S  0

#define DPORT_PRO_ICACHE_LOCK1_SIZE_REG          (DR_REG_EXTMEM_BASE + 0x058)
/* DPORT_PRO_ICACHE_LOCK1_SIZE : R/W ;bitpos:[15:0] ;default: 16'h0 ; */
/*description: */
#define DPORT_PRO_ICACHE_LOCK1_SIZE  0x0000FFFF
#define DPORT_PRO_ICACHE_LOCK1_SIZE_M  ((DPORT_PRO_ICACHE_LOCK1_SIZE_V)<<(DPORT_PRO_ICACHE_LOCK1_SIZE_S))
#define DPORT_PRO_ICACHE_LOCK1_SIZE_V  0xFFFF
#define DPORT_PRO_ICACHE_LOCK1_SIZE_S  0

#define DPORT_PRO_ICACHE_MEM_SYNC0_REG          (DR_REG_EXTMEM_BASE + 0x05C)
/* DPORT_PRO_ICACHE_MEMSYNC_ADDR : R/W ;bitpos:[31:0] ;default: 32'b0 ; */
/*description: */
#define DPORT_PRO_ICACHE_MEMSYNC_ADDR  0xFFFFFFFF
#define DPORT_PRO_ICACHE_MEMSYNC_ADDR_M  ((DPORT_PRO_ICACHE_MEMSYNC_ADDR_V)<<(DPORT_PRO_ICACHE_MEMSYNC_ADDR_S))
#define DPORT_PRO_ICACHE_MEMSYNC_ADDR_V  0xFFFFFFFF
#define DPORT_PRO_ICACHE_MEMSYNC_ADDR_S  0

#define DPORT_PRO_ICACHE_MEM_SYNC1_REG          (DR_REG_EXTMEM_BASE + 0x060)
/* DPORT_PRO_ICACHE_MEMSYNC_SIZE : R/W ;bitpos:[22:0] ;default: 23'h400000 ; */
/*description: */
#define DPORT_PRO_ICACHE_MEMSYNC_SIZE  0x007FFFFF
#define DPORT_PRO_ICACHE_MEMSYNC_SIZE_M  ((DPORT_PRO_ICACHE_MEMSYNC_SIZE_V)<<(DPORT_PRO_ICACHE_MEMSYNC_SIZE_S))
#define DPORT_PRO_ICACHE_MEMSYNC_SIZE_V  0x7FFFFF
#define DPORT_PRO_ICACHE_MEMSYNC_SIZE_S  0

#define DPORT_PRO_ICACHE_PRELOAD_ADDR_REG          (DR_REG_EXTMEM_BASE + 0x064)
/* DPORT_PRO_ICACHE_PRELOAD_ADDR : R/W ;bitpos:[31:0] ;default: 32'b0 ; */
/*description: */
#define DPORT_PRO_ICACHE_PRELOAD_ADDR  0xFFFFFFFF
#define DPORT_PRO_ICACHE_PRELOAD_ADDR_M  ((DPORT_PRO_ICACHE_PRELOAD_ADDR_V)<<(DPORT_PRO_ICACHE_PRELOAD_ADDR_S))
#define DPORT_PRO_ICACHE_PRELOAD_ADDR_V  0xFFFFFFFF
#define DPORT_PRO_ICACHE_PRELOAD_ADDR_S  0

#define DPORT_PRO_ICACHE_PRELOAD_SIZE_REG          (DR_REG_EXTMEM_BASE + 0x068)
/* DPORT_PRO_ICACHE_PRELOAD_ORDER : R/W ;bitpos:[16] ;default: 1'b0 ; */
/*description: */
#define DPORT_PRO_ICACHE_PRELOAD_ORDER  (BIT(16))
#define DPORT_PRO_ICACHE_PRELOAD_ORDER_M  (BIT(16))
#define DPORT_PRO_ICACHE_PRELOAD_ORDER_V  0x1
#define DPORT_PRO_ICACHE_PRELOAD_ORDER_S  16
/* DPORT_PRO_ICACHE_PRELOAD_SIZE : R/W ;bitpos:[15:0] ;default: 16'h8000 ; */
/*description: */
#define DPORT_PRO_ICACHE_PRELOAD_SIZE  0x0000FFFF
#define DPORT_PRO_ICACHE_PRELOAD_SIZE_M  ((DPORT_PRO_ICACHE_PRELOAD_SIZE_V)<<(DPORT_PRO_ICACHE_PRELOAD_SIZE_S))
#define DPORT_PRO_ICACHE_PRELOAD_SIZE_V  0xFFFF
#define DPORT_PRO_ICACHE_PRELOAD_SIZE_S  0

#define DPORT_PRO_ICACHE_AUTOLOAD_CFG_REG          (DR_REG_EXTMEM_BASE + 0x06C)
/* DPORT_PRO_ICACHE_AUTOLOAD_SIZE : R/W ;bitpos:[21:6] ;default: 16'h1 ; */
/*description: */
#define DPORT_PRO_ICACHE_AUTOLOAD_SIZE  0x0000FFFF
#define DPORT_PRO_ICACHE_AUTOLOAD_SIZE_M  ((DPORT_PRO_ICACHE_AUTOLOAD_SIZE_V)<<(DPORT_PRO_ICACHE_AUTOLOAD_SIZE_S))
#define DPORT_PRO_ICACHE_AUTOLOAD_SIZE_V  0xFFFF
#define DPORT_PRO_ICACHE_AUTOLOAD_SIZE_S  6
/* DPORT_PRO_ICACHE_AUTOLOAD_RQST : R/W ;bitpos:[5:4] ;default: 1'b0 ; */
/*description: */
#define DPORT_PRO_ICACHE_AUTOLOAD_RQST  0x00000003
#define DPORT_PRO_ICACHE_AUTOLOAD_RQST_M  ((DPORT_PRO_ICACHE_AUTOLOAD_RQST_V)<<(DPORT_PRO_ICACHE_AUTOLOAD_RQST_S))
#define DPORT_PRO_ICACHE_AUTOLOAD_RQST_V  0x3
#define DPORT_PRO_ICACHE_AUTOLOAD_RQST_S  4
/* DPORT_PRO_ICACHE_AUTOLOAD_ORDER : R/W ;bitpos:[3] ;default: 1'b0 ; */
/*description: */
#define DPORT_PRO_ICACHE_AUTOLOAD_ORDER  (BIT(3))
#define DPORT_PRO_ICACHE_AUTOLOAD_ORDER_M  (BIT(3))
#define DPORT_PRO_ICACHE_AUTOLOAD_ORDER_V  0x1
#define DPORT_PRO_ICACHE_AUTOLOAD_ORDER_S  3
/* DPORT_PRO_ICACHE_AUTOLOAD_STEP : R/W ;bitpos:[2:1] ;default: 2'b0 ; */
/*description: */
#define DPORT_PRO_ICACHE_AUTOLOAD_STEP  0x00000003
#define DPORT_PRO_ICACHE_AUTOLOAD_STEP_M  ((DPORT_PRO_ICACHE_AUTOLOAD_STEP_V)<<(DPORT_PRO_ICACHE_AUTOLOAD_STEP_S))
#define DPORT_PRO_ICACHE_AUTOLOAD_STEP_V  0x3
#define DPORT_PRO_ICACHE_AUTOLOAD_STEP_S  1
/* DPORT_PRO_ICACHE_AUTOLOAD_MODE : R/W ;bitpos:[0] ;default: 1'd0 ; */
/*description: */
#define DPORT_PRO_ICACHE_AUTOLOAD_MODE  (BIT(0))
#define DPORT_PRO_ICACHE_AUTOLOAD_MODE_M  (BIT(0))
#define DPORT_PRO_ICACHE_AUTOLOAD_MODE_V  0x1
#define DPORT_PRO_ICACHE_AUTOLOAD_MODE_S  0

#define DPORT_PRO_ICACHE_AUTOLOAD_SECTION0_ADDR_REG          (DR_REG_EXTMEM_BASE + 0x070)
/* DPORT_PRO_ICACHE_AUTOLOAD_SCT0_ADDR : R/W ;bitpos:[31:0] ;default: 32'b0 ; */
/*description: */
#define DPORT_PRO_ICACHE_AUTOLOAD_SCT0_ADDR  0xFFFFFFFF
#define DPORT_PRO_ICACHE_AUTOLOAD_SCT0_ADDR_M  ((DPORT_PRO_ICACHE_AUTOLOAD_SCT0_ADDR_V)<<(DPORT_PRO_ICACHE_AUTOLOAD_SCT0_ADDR_S))
#define DPORT_PRO_ICACHE_AUTOLOAD_SCT0_ADDR_V  0xFFFFFFFF
#define DPORT_PRO_ICACHE_AUTOLOAD_SCT0_ADDR_S  0

#define DPORT_PRO_ICACHE_AUTOLOAD_SECTION0_SIZE_REG          (DR_REG_EXTMEM_BASE + 0x074)
/* DPORT_PRO_ICACHE_AUTOLOAD_SCT0_SIZE : R/W ;bitpos:[23:0] ;default: 24'h8000 ; */
/*description: */
#define DPORT_PRO_ICACHE_AUTOLOAD_SCT0_SIZE  0x00FFFFFF
#define DPORT_PRO_ICACHE_AUTOLOAD_SCT0_SIZE_M  ((DPORT_PRO_ICACHE_AUTOLOAD_SCT0_SIZE_V)<<(DPORT_PRO_ICACHE_AUTOLOAD_SCT0_SIZE_S))
#define DPORT_PRO_ICACHE_AUTOLOAD_SCT0_SIZE_V  0xFFFFFF
#define DPORT_PRO_ICACHE_AUTOLOAD_SCT0_SIZE_S  0

#define DPORT_PRO_ICACHE_AUTOLOAD_SECTION1_ADDR_REG          (DR_REG_EXTMEM_BASE + 0x078)
/* DPORT_PRO_ICACHE_AUTOLOAD_SCT1_ADDR : R/W ;bitpos:[31:0] ;default: 32'b0 ; */
/*description: */
#define DPORT_PRO_ICACHE_AUTOLOAD_SCT1_ADDR  0xFFFFFFFF
#define DPORT_PRO_ICACHE_AUTOLOAD_SCT1_ADDR_M  ((DPORT_PRO_ICACHE_AUTOLOAD_SCT1_ADDR_V)<<(DPORT_PRO_ICACHE_AUTOLOAD_SCT1_ADDR_S))
#define DPORT_PRO_ICACHE_AUTOLOAD_SCT1_ADDR_V  0xFFFFFFFF
#define DPORT_PRO_ICACHE_AUTOLOAD_SCT1_ADDR_S  0

#define DPORT_PRO_ICACHE_AUTOLOAD_SECTION1_SIZE_REG          (DR_REG_EXTMEM_BASE + 0x07C)
/* DPORT_PRO_ICACHE_AUTOLOAD_SCT1_SIZE : R/W ;bitpos:[23:0] ;default: 24'h8000 ; */
/*description: */
#define DPORT_PRO_ICACHE_AUTOLOAD_SCT1_SIZE  0x00FFFFFF
#define DPORT_PRO_ICACHE_AUTOLOAD_SCT1_SIZE_M  ((DPORT_PRO_ICACHE_AUTOLOAD_SCT1_SIZE_V)<<(DPORT_PRO_ICACHE_AUTOLOAD_SCT1_SIZE_S))
#define DPORT_PRO_ICACHE_AUTOLOAD_SCT1_SIZE_V  0xFFFFFF
#define DPORT_PRO_ICACHE_AUTOLOAD_SCT1_SIZE_S  0

#define DPORT_IC_PRELOAD_CNT_REG          (DR_REG_EXTMEM_BASE + 0x080)
/* DPORT_IC_PRELOAD_CNT : RO ;bitpos:[31:0] ;default: 32'h0 ; */
/*description: */
#define DPORT_IC_PRELOAD_CNT  0xFFFFFFFF
#define DPORT_IC_PRELOAD_CNT_M  ((DPORT_IC_PRELOAD_CNT_V)<<(DPORT_IC_PRELOAD_CNT_S))
#define DPORT_IC_PRELOAD_CNT_V  0xFFFFFFFF
#define DPORT_IC_PRELOAD_CNT_S  0

